In [1]:
import pandas as pd

In [4]:
# series 는 생성자
# 리스트로 시리즈 생성
sr = pd.Series([1,2,3,4,5])
sr

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
# 튜플로 시리즈 생성
sr = pd.Series((1,2,3,4,5))
sr

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
# 딕셔너리로 시리즈 생성
sr = pd.Series({'a':1,'b':2,'c':3,'d':4,'e':5})
sr

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
# numpy 배열로 시리즈 생성
import numpy as np
sr = pd.Series(np.array([1,2,3,4,5]))
sr

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [11]:
# 기존 시리즈로 시리즈 생성
sr_01 = pd.Series([1,2,3,4,5])
sr_02 = pd.Series(sr_01)
sr_02

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [14]:
sr = pd.Series(data=[1,2,3,4,5], index=['a','b','c','d','e'])
sr

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [21]:
# 시리즈 이름 지정
sr_01 = pd.Series(data=[1,2,3,4,5], index=['a','b','c','d','e'], name='Group_01')
sr_02 = pd.Series(data=[6,7,8,9,10], index=['a','b','c','d','e'], name='Group_02')

df = pd.concat([sr_01,sr_02], axis=1)
df

   Group_01  Group_02
a         1         6
b         2         7
c         3         8
d         4         9
e         5        10

In [5]:
arr = np.array([1,2,3,4,5])
sr = pd.Series(arr, copy=False)

sr[0] = 999
sr[1] = 999

print(arr, '\n')
print(sr)

[999 999   3   4   5]

0    999
1    999
2      3
3      4
4      5
dtype: int32

In [6]:
lst = [1,2,3,4,5]
sr = pd.Series(lst, copy=False)

sr[0] = 999
sr[1] = 999

print(lst, '\n')
print(sr)

[1, 2, 3, 4, 5]

0    999
1    999
2      3
3      4
4      5
dtype: int64

# 함수

In [16]:
sr = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
sr2 = pd.Series([np.nan,2,3,4,5], index=['a','b','c','d','e'])
sr.index
sr.values
sr.shape
sr.ndim
sr.dtype
sr.nbytes # 메모리 용량
sr2.hasnans  # nan  not a number
sr.empty

False

In [17]:
sr = pd.Series([10,20,30,40], index=['A','B','C','D'])
sr

A    10
B    20
C    30
D    40
dtype: int64

In [20]:
sr[0]
sr.iloc[0]

10

In [24]:
print(sr[[0,2,3]])
print(sr[0:2])
print(sr.iloc[2:])

A    10
C    30
D    40
dtype: int64
A    10
B    20
dtype: int64
C    30
D    40
dtype: int64

In [25]:
sr.loc['A']

10

In [26]:
sr.loc['A':'C']

A    10
B    20
C    30
dtype: int64

In [28]:
sr[sr > 20] # 조건도 가능함

C    30
D    40
dtype: int64

In [34]:
# 데이터 추가
data = [1,2,3,4,5]
idx = ['A', 'B','C','D','E']

sr = pd.Series(data, index=idx)
sr.loc['F'] = 6 # 추가
sr.loc['B'] = 6 # 변경
sr

A    1
B    6
C    3
D    4
E    5
F    6
dtype: int64

In [37]:
data = [1,2,3,4,5]
idx = ['A', 'B','C','D','E']

sr = pd.Series(data, index=idx)
sr.drop(['B', 'D'])

A    1
C    3
E    5
dtype: int64

In [42]:
# 구분자가 쉼표가 아니라 공백일 경우
df = pd.read_csv('for_test.csv', encoding='cp949', sep=' ')

In [44]:
df = pd.read_csv('for_test.csv', encoding='cp949')
df

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [46]:
# 라벨 중 원하는 것을 인덱스로 넣기

df = pd.read_csv('for_test.csv', encoding='cp949', index_col='연도')
df

           동해       남해       서해       전체
연도
1996  17.4629  17.2288  14.4360  15.9067
1997  17.4116  17.4092  14.8248  16.1526
1998  17.5944  18.0110  15.2512  16.6044
1999  18.1495  18.3175  14.8979  16.6284
2000  17.9288  18.1766  15.0504  16.6178

In [47]:
df.loc[1997:1999]

           동해       남해       서해       전체
연도
1997  17.4116  17.4092  14.8248  16.1526
1998  17.5944  18.0110  15.2512  16.6044
1999  18.1495  18.3175  14.8979  16.6284

In [51]:
df.to_csv('for_saving_test.csv', encoding='cp949', sep=' ')